# 이 문제는 전체 폰켓몬의 절반을 골랐을 때, 최대 몇 종류를 고를 수 있는지 구하는 문제
# 어떤 폰켓몬을 골랐는지가 아니라 종류의 개수를 반환하면 됨
#ex) nums = [3, 1, 2, 3] 총 4마리 이므로 2마리를 고를 수 있음.
# 종류는 1,2,3번으로 3종류. 2마리만 가져갈 수 있으므로 최대 2종류를 선택 가능
# --> 핵심은 '고를 수 있는 마릿수'와 '전체 종류 수' 중 작은 값이 정답

def solution(nums): # 폰켓몬 종류 번호가 담긴 리스트 nums를 전달받음
    max_pick = len(nums) // 2   # 고를 수 있는 마릿수 계산
    # len(nums): 리스트에 들어 있는 원소의 개수, 즉 전체 마릿수
    # //2 : 2로 나눈 몫을 정수로 구하기
    
    types = set(nums) # 중복을 없애서 종류만 남기기
    # set은 중복된 값을 하나만 남기는 집합
    # len(types) 종류 수: 3 --> 단, 집합은 순서를 보장하지 않음. 여기서는 종류의 개수만 필요하므로 순서는 상관 없음.
    
    answer = min(max_pick, len(types)) # 작은 값 선택
    # min(a, b)는 두 값 중 작은 값을 구하는 함수
    # 왜 작은 값을 선택할까? 
    # --> 종류가 아무리 많아도 가져갈 수 있는 마릿수보다 많은 종류를 고를 수 없음
    # --> 많이 가져갈 수 있어도 실제로 존재하는 종류 수보다 많은 종류를 고를 수 없음
    
    return answer
